## Pandas Basis

In [2]:
# import necessary package
import pandas as pd
import numpy as np

In [3]:
# generate a dataset and convert to pandas dataframe

data = {'name': ['Jack', 'Annie', 'Bob', 'Jake', 'Jasper'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'grades': [4, 20, 15, 7, 24],
        'coverage': [25, 94, 57, 62, 70]}

df = pd.DataFrame(data, index = ['Cochic', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

              name  year  grades  coverage
Cochic        Jack  2012       4        25
Pima         Annie  2012      20        94
Santa Cruz     Bob  2013      15        57
Maricopa      Jake  2014       7        62
Yuma        Jasper  2014      24        70

#### 1. Show the first three rows and last two rows.

In [8]:
df[0:3]

             name  year  grades  coverage
Cochic       Jack  2012       4        25
Pima        Annie  2012      20        94
Santa Cruz    Bob  2013      15        57

In [15]:
df[3:]

            name  year  grades  coverage
Maricopa    Jake  2014       7        62
Yuma      Jasper  2014      24        70

#### 2. Generate a new dataframe including county,year and reports from above datafram (county and reports can be NaN)

In [76]:
data2 = {'name': ['Jack', 'Annie', 'Bob', 'Jake', 'Jasper'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'grades': [4, 20, 15, 7, 24],
        'coverage': [25, 94, 57, 62, 70],
        'country':None,
        #'year':[None],
        'reports':None}
#df2 = pd.DataFrame(df2)
df2 = pd.DataFrame(data2,index = ['Cochic', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df2

              name  year  grades  coverage country reports
Cochic        Jack  2012       4        25    None    None
Pima         Annie  2012      20        94    None    None
Santa Cruz     Bob  2013      15        57    None    None
Maricopa      Jake  2014       7        62    None    None
Yuma        Jasper  2014      24        70    None    None

#### 3. Add a new column attribute called "New", which is NaN.

In [77]:
df2['New']=None
df2

              name  year  grades  coverage country reports   New
Cochic        Jack  2012       4        25    None    None  None
Pima         Annie  2012      20        94    None    None  None
Santa Cruz     Bob  2013      15        57    None    None  None
Maricopa      Jake  2014       7        62    None    None  None
Yuma        Jasper  2014      24        70    None    None  None

#### 4. Delete the column "New".

In [78]:
df2.drop(['New'],axis=1)

              name  year  grades  coverage country reports
Cochic        Jack  2012       4        25    None    None
Pima         Annie  2012      20        94    None    None
Santa Cruz     Bob  2013      15        57    None    None
Maricopa      Jake  2014       7        62    None    None
Yuma        Jasper  2014      24        70    None    None

#### 5. Show the index and columns name.

In [ ]:
df2[]

#### 6. Use df.iloc to select the first row

In [79]:
df2.iloc[0]

name        Jack
year        2012
grades         4
coverage      25
country     None
reports     None
New         None
Name: Cochic, dtype: object

#### 7. Slice the column of "coverage" and "grades".

In [72]:
df2[['coverage','grades']]

   coverage  grades
0        25       4
1        94      20
2        57      15
3        62       7
4        70      24

#### 8. select subtable of column name and year, row of Pima and Yuma

In [92]:
df2.loc[['Pima','Yuma'],['name','year']]

        name  year
Pima   Annie  2012
Yuma  Jasper  2014

#### 9. Use df.iloc to select the first two columns

In [95]:
df2.iloc[:,:2]

              name  year
Cochic        Jack  2012
Pima         Annie  2012
Santa Cruz     Bob  2013
Maricopa      Jake  2014
Yuma        Jasper  2014

#### 10. Select by condition where grades greater than 10

In [98]:
df2[df2.grades>10]

              name  year  grades  coverage country reports   New
Pima         Annie  2012      20        94    None    None  None
Santa Cruz     Bob  2013      15        57    None    None  None
Yuma        Jasper  2014      24        70    None    None  None

#### 11. Drop Rows of Cochic and Pima

In [109]:
df2.drop(['Cochic'],axis=0)
#df2.drop([['Cochic','Pima']],axis=0)

              name  year  grades  coverage country reports   New
Pima         Annie  2012      20        94    None    None  None
Santa Cruz     Bob  2013      15        57    None    None  None
Maricopa      Jake  2014       7        62    None    None  None
Yuma        Jasper  2014      24        70    None    None  None

#### 12. Use df.drop to drop the column grades.

In [104]:
df2.drop(['grades'],axis=1)

              name  year  coverage country reports   New
Cochic        Jack  2012        25    None    None  None
Pima         Annie  2012        94    None    None  None
Santa Cruz     Bob  2013        57    None    None  None
Maricopa      Jake  2014        62    None    None  None
Yuma        Jasper  2014        70    None    None  None

#### 13. Use decribe function to show some statistics of column "coverage".

In [110]:
df2['coverage'].describe()

count     5.000000
mean     61.600000
std      24.905823
min      25.000000
25%      57.000000
50%      62.000000
75%      70.000000
max      94.000000
Name: coverage, dtype: float64

### Pandas Fast Visualization

Read the following reading materials:<br/>
https://pandas.pydata.org/pandas-docs/stable/visualization.html